app/views/beer_clubs/show.html.erb

SELECT  1 AS one FROM "beer_clubs" INNER JOIN "memberships" ON "beer_clubs"."id" = "memberships"."beer_club_id" WHERE "memberships"."user_id" = ? AND "beer_clubs"."id" = 1 LIMIT 1  [["user_id", 1]]
---

<% if current_user && !current_user.beer_clubs.include?(@beer_club) %>