app/controllers/beer_clubs_controller.rb

  def index
    @beer_clubs = BeerClub.all
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def show
    if current_user.nil? || !current_user.beer_clubs.include?(@beer_club)
      @membership = Membership.new
    else
      @membership = Membership.find_by_beer_club_id(@beer_club.id)
---
SELECT  1 AS one FROM "beer_clubs" INNER JOIN "memberships" ON "beer_clubs"."id" = "memberships"."beer_club_id" WHERE "memberships"."user_id" = ? AND "beer_clubs"."id" = 1 LIMIT 1  [["user_id", 1]]
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."beer_club_id" = 1 LIMIT 1

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Nakkila"], ["created_at", "2015-02-15 14:58:39.084826"], ["founded", 2000], ["name", "test"], ["updated_at", "2015-02-15 14:58:39.084826"]]

    def set_beer_club
      @beer_club = BeerClub.find(params[:id])
---
SELECT  "beer_clubs".* FROM "beer_clubs"  WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]