app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    @memberships = Membership.all

SELECT  "beer_clubs".* FROM "beer_clubs"  WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", "2015-02-15 15:05:44.806206"], ["updated_at", "2015-02-15 15:05:44.806206"], ["user_id", 1]]
---
  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user
    @beer_club = BeerClub.find(@membership.beer_club_id)

    respond_to do |format|
      if @membership.save

SELECT  "beer_clubs".* FROM "beer_clubs"  WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 6]]
---
  def destroy
    @beer_club = BeerClub.find(@membership.beer_club_id)
    @membership.destroy

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_membership
      @membership = Membership.find(params[:id])